In [1]:
import pandas as pd
import numpy as np

In [4]:
data = np.array(['a','b','c','d'])
data

array(['a', 'b', 'c', 'd'], dtype='<U1')

In [7]:
df = pd.DataFrame(data)
df

   0
0  a
1  b
2  c
3  d

In [9]:
data = [1,'hi',3,4,'hyd']
data

[1, 'hi', 3, 4, 'hyd']

In [11]:
df2 = pd.DataFrame(data)
df2

     0
0    1
1   hi
2    3
3    4
4  hyd

In [13]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,42]}

In [14]:
pd.DataFrame(data)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [26]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

In [27]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [28]:
k = df.groupby('Team')
k

In [29]:
for x in k:
    print(x)

('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)
('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788)
('Riders',       Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690)
('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [30]:
df.plot(x='Team',y='Year',kind='hist')

In [32]:
df1 = pd.DataFrame({
'id':[1,2,3,4,5],
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'subject_id':['sub1','sub2','sub4','sub6','sub5']})

df2 = pd.DataFrame(
{'id':[1,2,3,4,5],
'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'subject_id':['sub2','sub4','sub3','sub6','sub5']})

print(df1)

print(df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [35]:
print(pd.merge(df1,df2,on=['id','subject_id'],how='right'))

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty
2   1     NaN       sub2  Billy
3   2     NaN       sub4  Brian
4   3     NaN       sub3   Bran

In [3]:
import os
os.getcwd()

'C:\\AI_ML\\ML_python\\Python_Practices\\pandas'

In [58]:
iris = pd.read_csv('iris.csv')

In [55]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm PetalWidthCm      Species
0   1            5.1           3.5            1.4          0.2  Iris-setosa
1   2            4.9           3.0            1.4          0.2  Iris-setosa
2   3            4.7           3.2            1.3          0.2  Iris-setosa
3   4            4.6           3.1            1.5          0.2  Iris-setosa
4   5            5.0           3.6            1.4          0.2  Iris-setosa

In [51]:
iris.shape

(150, 6)

In [53]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [59]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [45]:
emp = pd.read_csv('C:\AI_ML\ML_python\Python_Practices\pandas\emp_details.txt',sep='|',index_col='user_id')

In [46]:
emp2 = emp.head(8)

In [47]:
emp2

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201

In [48]:
exl = pd.read_excel('sample_iris1.xls',sheet_name=1)

In [33]:
exl

    id  sepal-length sepal-width  petal-length  petal-width        class
0    0           5.1         3.5           1.4          0.2  Iris-setosa
1    1           4.9           3           1.4          NaN  Iris-setosa
2    2           4.7         3.2           1.3          0.2  Iris-setosa
3    3           NaN         3.1           1.5          0.2  Iris-setosa
4    4           5.0         3.6           NaN          0.2  Iris-setosa
5    5           5.4         hhh           1.7          0.4  Iris-setosa
6    6           4.6         3.4           1.4          0.3  Iris-setosa
7    7           5.0         3.4           1.5          0.2  Iris-setosa
8    8           4.4         2.9           1.4          0.2  Iris-setosa
9    9           4.9         3.1           1.5          0.1  Iris-setosa
10  10           5.4         3.7           1.5          0.2  Iris-setosa

In [36]:
exl.iloc[[2]]

   id  sepal-length sepal-width  petal-length  petal-width        class
2   2           4.7         3.2           1.3          0.2  Iris-setosa

In [37]:
exl.ix[:,'sepal-width']

C:\Users\karthi\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0     3.5
1       3
2     3.2
3     3.1
4     3.6
5     hhh
6     3.4
7     3.4
8     2.9
9     3.1
10    3.7
Name: sepal-width, dtype: object

In [41]:
iris2 = pd.read_csv('sample_iris.csv')

In [42]:
iris2.dropna()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa
8   9            4.4           2.9            1.4           0.2  Iris-setosa

In [44]:
iris2.fillna(2.9)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            2.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           2.9  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
5   6            5.4           2.9            1.7           2.9  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa
8   9            4.4           2.9            1.4           0.2  Iris-setosa

In [49]:
emp2.to_csv('hello.csv')